content/notes.org
#+TITLE: Research Notes

#+setupfile: config.org

* Type declarations
When translating a type declaration into separation logic, we have to
create, besides the type definition, a representation predicate that
receives a program variable and lifts it into a logical
representation. This logical representation is defined using the ~model~
field in the type specification.

** Unnamed Model Fields
One of the changes we made to the {{{Gospel}}} typechecker was allowing
~model~ fields to be unnamed. For example, if we wish to specify a queue
in current gospel whose logical model is a ~sequence~, we must write as
such.
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
type t
(*@ model view : int sequence *)

val push : t -> int -> unit 
(*@ push q x
    ensures q.view = old q.view ++ [x] *)
 #+end_example
Although the model of the queue is the only thing that interests us in
this specification (and indeed, most specifications) we still have to
access it via the field ~view~. This can not only be cumbersome but also
make specifications more verbose than they need be. Although the
example above is still valid in {{{Gospel}}}, we have developed an alternate
syntax for cases where types only have a single ~model~ field.
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
type t
(*@ model : int sequence *)

val push : t -> int -> unit
(*@ push q x
    ensures q = old q ++ [x] *)
#+end_example
In the second code snippet, ~q~ in the specification has the same type
as its model field. This way, the specification becomes a bit easier
to write and read.

** Multiple Model Fields
When creating the representation predicate for a type with named ~model~
fields, we have the option between creating a predicate with multiple
fields for the logical values or creating a record type with each
field described in the specification. I believe that the sanest way to
do this is by using ghost record type. This is because multiple fields
can make the translation more illegible, as well as more difficult to
execute, seeing as I would have to replace all occurrences of model
field accesses as well as manage potential problems with clashing
names.

Example (assuming ~x~ is of type ~t~ with two model fields ~y~ and ~z~) :
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
(*@ f x y z
    ensures x.y + y = z *)
#+end_example
would become, during translation
#+begin_equation*
{}(f(x, y, z)){P(x, y, z) * y + y = z}
#+end_equation*
While typing, I assume just one type and, in the specification, handle
the model fields as ~ghost~ fields (which is already the default
behaviour). While translating to separation logic, I create two types,
one for the program type and another for the model.
*** Naming problems
The tricky question to solve however is what names to give these
types? I think the easiest solution is to give the logical type
the same name as the {{{OCaml}}} type and give the program type the same
name, but with an underscore at the beginning. This way, we don't have
to change anything in the typed specification.
** <<ep>>Ephemeral and Pure Annotations
It is also possible to not give the type a ~model~ field and instead opt
to give an ~ephemeral~ annotation as such
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
type t
(*@ ephemeral *)
#+end_example
This way, we can mark the type as mutable without giving a precise
definition of its logical representation. If the type has no
annotations, then we assume it to be pure and its model is a
reflection of the {{{OCaml}}} type.
** Representation Predicates
As stated previously, when we translate a type declaration, we also
need to generate an appropriate representation predicate. How we do so
depends on how the type is defined.

*** Abstract Types
Since we cannot give a representation predicate to a type that is
undefined in the program, we simply create its signature. This
predicate will have two arguments, the program value and the logical
representation, that is, the type defined in its ~model~ clause.
+ If the type is pure, then the program value is the same as the {{{OCaml}}}
  type. In the case where the ~model~ is a reflection of the {{{OCaml}}} type
  as described in Section [[ep][Ephemeral and Pure Annotations]], no
  representation predicate is generated
+ If the type is mutable, then the program value is of type ~loc~.
*** Concrete Types
TBD
  
*** Note on naming
Generally, the generated representation predicate has the same name
as the original type, but with the first letter capitalized and an
underscore at the start. However, when the type's name is ~t~, the
representation predicate gets the same name as the name of the module,
so as to make the generated Separation Logic triples simpler to read.
