notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Research Notes</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Research Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org91abe70">Type declarations</a>
<ul>
<li><a href="#orgc4774aa">Unnamed Model Fields</a></li>
<li><a href="#org2ca8cf6">Multiple Model Fields</a>
<ul>
<li><a href="#org1f184b2">Naming problems</a></li>
</ul>
</li>
<li><a href="#org79e63f1">Ephemeral and Pure Annotations</a></li>
<li><a href="#org4e35ea6">Representation Predicates</a>
<ul>
<li><a href="#org5f9a150">Abstract Types</a></li>
<li><a href="#orgd986f42">Concrete Types</a></li>
<li><a href="#org44ed15e">Note on naming</a></li>
</ul>
</li>
<li><a href="#org2cf1d71">Translation of Type declarations</a></li>
<li><a href="#orgd351f4c">Implementation</a></li>
<li><a href="#org2efc180">Limitations</a></li>
</ul>
</li>
<li><a href="#orga257a1b">Value descriptions</a>
<ul>
<li><a href="#org3aa6741">Lenses</a></li>
<li><a href="#org7aa2565">Ownership clauses</a></li>
<li><a href="#org763c5cf">Available Lenses</a></li>
<li><a href="#org84fd8df">Limitations</a></li>
<li><a href="#orgf0ca78e">Translations of Lenses</a></li>
<li><a href="#orgecb8372">Logical Quantifiers</a></li>
</ul>
</li>
<li><a href="#org391cddc"><code>Prop</code> and <code>Bool</code></a>
<ul>
<li><a href="#org69bffcd">How the translation is done:</a>
<ul>
<li><a href="#org4d4b2db">Equality</a></li>
<li><a href="#org1d63437">Pattern Matching</a></li>
<li><a href="#org9b37c5f">Program Variables</a></li>
<li><a href="#orge1a6f8a">Bazinga</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbf9eec7">Gospel Type Semantics</a></li>
<li><a href="#org803c5c3">Higher order lenses</a></li>
<li><a href="#org82724a0">Lemmas</a></li>
<li><a href="#org4cfaefc">Open Questions</a>
<ul>
<li><a href="#orgf196025">Impure Types in Logical Terms</a></li>
<li><a href="#org29431a2">Recursive Ownership of Elements</a>
<ul>
<li><a href="#org72e2513">The Problem</a></li>
<li><a href="#orgdbefefa">Magic Wand (in Gospel)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9684506">Exceptional Specifications</a>
<ul>
<li><a href="#orgcedb800">Problems with ownership clauses</a></li>
<li><a href="#orgf1be234">Changes to the Gospel syntax</a></li>
</ul>
</li>
<li><a href="#org798ee8f"><span class="todo TODO">TODO</span> Functor Constraints</a></li>
<li><a href="#orgf87e6e5">Updated syntax</a></li>
<li><a href="#orgdfce41a">Shared Resources</a>
<ul>
<li><a href="#org7b250c9">Mutex example (monomorphic)</a></li>
<li><a href="#org1f1b025">Mutex example</a></li>
<li><a href="#org819a9bc">Explicitly guarded mutex</a></li>
<li><a href="#org92d5a72">Explicitly guarded mutex v2</a></li>
<li><a href="#org867f5b0">Shared Lock</a></li>
</ul>
</li>
<li><a href="#orgc3b3355">Syntax for the Gospel Standard Library</a>
<ul>
<li><a href="#org98ec0a7">The empty element</a></li>
<li><a href="#org31e64a4">Initialization</a></li>
<li><a href="#org89d2422">Set operations</a></li>
</ul>
</li>
<li><a href="#orgf7d83bd">Miscellaneous changes</a>
<ul>
<li><a href="#org10918b6"><code>old</code> in Gospel function specifications</a></li>
</ul>
</li>
<li><a href="#org3f6c56b">Gospel documentation</a></li>
<li><a href="#org79eaca6">Internal Changes to Gospel</a>
<ul>
<li><a href="#org09758ee"><span class="done DONE">DONE</span> Normalise AST constructors for function applications</a></li>
<li><a href="#org938be6d"><span class="todo TODO">TODO</span> Gospel Type checker with Inferno</a>
<ul>
<li><a href="#org77c823d">Things left to do</a></li>
<li><a href="#orga8dc7be">Issues</a></li>
</ul>
</li>
<li><a href="#org4f6a2b9"><span class="done DONE">DONE</span> Inferno Efficiency</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org91abe70" class="outline-2">
<h2 id="org91abe70">Type declarations</h2>
<div class="outline-text-2" id="text-org91abe70">
<p>
When translating a type declaration into separation logic, we have to
create, besides the type definition, a representation predicate that
receives a program variable and lifts it into a logical
representation. This logical representation is defined using the <code>model</code>
field in the type specification.
</p>
</div>

<div id="outline-container-orgc4774aa" class="outline-3">
<h3 id="orgc4774aa">Unnamed Model Fields</h3>
<div class="outline-text-3" id="text-orgc4774aa">
<p>
One of the changes we made to the <b>Gospel</b> typechecker was allowing
<code>model</code> fields to be unnamed. For example, if we wish to specify a queue
in current gospel whose logical model is a <code>sequence</code>, we must write as
such.
</p>
<pre class="example" id="org53c2c8f">
type t
(*@ model view : int sequence *)

val push : t -&gt; int -&gt; unit 
(*@ push q x
    ensures q.view = old q.view ++ [x] *)
</pre>
<p>
Although the model of the queue is the only thing that interests us in
this specification (and indeed, most specifications) we still have to
access it via the field <code>view</code>. This can not only be cumbersome but also
make specifications more verbose than they need be. Although the
example above is still valid in <b>Gospel</b>, we have developed an alternate
syntax for cases where types only have a single <code>model</code> field.
</p>
<pre class="example" id="org25b3d62">
type t
(*@ model : int sequence *)

val push : t -&gt; int -&gt; unit
(*@ push q x
    ensures q = old q ++ [x] *)
</pre>
<p>
In the second code snippet, <code>q</code> in the specification has the same type
as its model field. This way, the specification becomes a bit easier
to write and read.
</p>
</div>
</div>

<div id="outline-container-org2ca8cf6" class="outline-3">
<h3 id="org2ca8cf6">Multiple Model Fields</h3>
<div class="outline-text-3" id="text-org2ca8cf6">
<p>
When creating the representation predicate for a type with named <code>model</code>
fields, we have the option between creating a predicate with multiple
fields for the logical values or creating a record type with each
field described in the specification. I believe that the sanest way to
do this is by using ghost record type. This is because multiple fields
can make the translation more illegible, as well as more difficult to
execute, seeing as I would have to replace all occurrences of model
field accesses as well as manage potential problems with clashing
names.
</p>

<p>
Example (assuming <code>x</code> is of type <code>t</code> with two model fields <code>y</code> and <code>z</code>) :
</p>
<pre class="example" id="org92c51cb">
(*@ f x y z
    ensures x.y + y = z *)
</pre>
<p>
would become, during translation
</p>
<div class="equation*" id="orgefeb765">
<p>
{}(f(x, y, z)){P(x, y, z) * y + y = z}
</p>

</div>
<p>
While typing, I assume just one type and, in the specification, handle
the model fields as <code>ghost</code> fields (which is already the default
behaviour). While translating to separation logic, I create two types,
one for the program type and another for the model.
</p>
</div>
<div id="outline-container-org1f184b2" class="outline-4">
<h4 id="org1f184b2">Naming problems</h4>
<div class="outline-text-4" id="text-org1f184b2">
<p>
The tricky question to solve however is what names to give these
types? I think the easiest solution is to give the logical type
the same name as the <b>OCaml</b> type and give the program type the same
name, but with an underscore at the beginning. This way, we don't have
to change anything in the typed specification.
</p>
</div>
</div>
</div>
<div id="outline-container-org79e63f1" class="outline-3">
<h3 id="org79e63f1"><a id="org40f82ff"></a>Ephemeral and Pure Annotations</h3>
<div class="outline-text-3" id="text-org79e63f1">
<p>
It is also possible to not give the type a <code>model</code> field and instead opt
to give an <code>ephemeral</code> annotation as such
</p>
<pre class="example" id="orge170ab4">
type t
(*@ ephemeral *)
</pre>
<p>
This way, we can mark the type as mutable without giving a precise
definition of its logical representation. If the type has no
annotations, then we assume it to be pure and its model is a
reflection of the <b>OCaml</b> type.
</p>
</div>
</div>
<div id="outline-container-org4e35ea6" class="outline-3">
<h3 id="org4e35ea6">Representation Predicates</h3>
<div class="outline-text-3" id="text-org4e35ea6">
<p>
As stated previously, when we translate a type declaration, we also
need to generate an appropriate representation predicate. How we do so
depends on how the type is defined.
</p>
</div>

<div id="outline-container-org5f9a150" class="outline-4">
<h4 id="org5f9a150">Abstract Types</h4>
<div class="outline-text-4" id="text-org5f9a150">
<p>
Since we cannot give a representation predicate to a type that is
undefined in the program, we simply create its signature. This
predicate will have two arguments, the program value and the logical
representation, that is, the type defined in its <code>model</code> clause.
</p>
<ul class="org-ul">
<li>If the type is pure, then the program value is the same as the <b>OCaml</b>
type. In the case where the <code>model</code> is a reflection of the <b>OCaml</b> type
as described in Section <a href="#org40f82ff">Ephemeral and Pure Annotations</a>, no
representation predicate is generated</li>
<li>If the type is mutable, then the program value is of type <code>loc</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd986f42" class="outline-4">
<h4 id="orgd986f42">Concrete Types</h4>
<div class="outline-text-4" id="text-orgd986f42">
<p>
TBD
</p>
</div>
</div>

<div id="outline-container-org44ed15e" class="outline-4">
<h4 id="org44ed15e">Note on naming</h4>
<div class="outline-text-4" id="text-org44ed15e">
<p>
Generally, the generated representation predicate has the same name
as the original type, but with the first letter capitalized and an
underscore at the start. However, when the type's name is <code>t</code>, the
representation predicate gets the same name as the name of the module,
so as to make the generated Separation Logic triples simpler to read.
</p>
</div>
</div>
</div>
