content/notes.org
** Translation of Type declarations
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
  type t
  (*@ model : int *)
#+end_example
 Translates into 
#+ATTR_LATEX: :environment cfml
#+begin_example coq
  Type t
  Predicate _T (target : t) (model : int)
#+end_example
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
  type t
  (*@ mutable model : int *)
#+end_example
Translates into
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Predicate _T (target : loc) (model : int)
#+end_example
#+ATTR_LATEX: :environment gospel 
#+begin_example ocaml
   type t
   (*@ model x : int
       model y : int *)
#+end_example
Translates into
#+ATTR_LATEX: :environment cfml
#+begin_example coq
  Type t = {x : int; y : int}
  Type _t
  
  Predicate _T (target : t) (model : _t)
#+end_example
#+end_example#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
   type t
   (*@ mutable model x : int
       model y : int
   *)
#+end_example
Translates into
#+ATTR_LATEX: :environment cfml
#+begin_example coq
  Type t = {x : int; y : int}
  Predicate _T (target : loc) (model : t)
#+end_example
** Implementation
1. Check if the type has a specification. If so, retrieve the model,
   if not, assume the model is a reflection of the OCaml type.
2. We must check if the type has multiple model fields. If so, we
   create an optional value that has the definition of a record type
   with all these fields. This type is always marked is
   non-mutable. The name of this type is the same as the name of the
   original type.
3. We create a definition of the type. The name of this type depends
   if we created a record in the previous step. If so, the name is the
   old name with an underscore at the start. Otherwise, the name is
   unchanged. For now, we only support abstract types.
4. We create the definition for the representation predicate. If the
   type is mutable, the first argument is of type ~loc~, otherwise, the
   first argument is the program type. The next argument is the type's
   model, as was defined previously.
** Limitations
+ When translated into {{{CFML}}}, record fields with names that have
  already been defined don't work (Low priority).
+ No support for polymorphic types with recursive ownership.
+ No support for concrete type definitions. This can be quite tricky
  since in these cases we would need to define an explicit
  representation predicate in {{{Gospel}}}, which is not yet possible.
  + Additionally, we must consider the relationship between invariants
    and representation predicates. 
* Value descriptions
When translating a value description and its specification, we must
take proper care to ensure that all the ownership conditions are
properly generated and are semantically equivalent to their {{{Gospel}}}
counterparts.
** Lenses
To describe ownership of values, we use what are called /Lenses/;
lightweight notation to encode representation predicates. For example,
let us assume once again a queue whose logical ~model~ is a sequence of
integers:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
type t
(*@ mutable model : int sequence *)

val push : t -> int -> unit
(*@ f q x
    modifies q
    ensures q = q ++ [x]*)
#+end_example
As I stated in the previous section, the variable ~q~ has type ~int
sequence~ in the specification. However, in the {{{OCaml}}} interface, it has
type ~t~. To make this transition, we require a representation predicate
(in {{{Gospel}}}'s case, a lens) that lifts the program value into
its logical value. In this case, we could write
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
val push : t -> int -> unit
(*@ f q x
    modifies q @ t
    ensures ... *)
#+end_example
The ~modifies~ clause states that we receive ownership of the {{{OCaml}}}
variable ~q~ using the lens ~t~ and lift it into the logical type
stated in ~t~'s model, that is, a sequence of integers. When we use the
lens with the same name as the original type (which we will
refer to as the /default lens)/, we say that we have full
ownership of that value. Additionally, the ~modifies~ clause also states
that we return the same ownership of ~q~. Given these semantics, we
could translate this specification into the following Separation Logic
triple (in {{{CFML}}} syntax for simplicity's sake).
#+ATTR_LATEX: :environment cfml
#+begin_example coq
forall (prog_q : loc) (q : int list) (x : int)
PRE (prog_q ~> Queue q)
POSTUNIT (prog_q ~> Queue (q ++ [x]))
#+end_example
Important to note that lenses are not exclusive used in
specifications as we see in the Section on [[quant][Logical Quantifiers]],
however, we will mostly focus on this use case as it is the most
common as well as the simplest.

** Ownership clauses
To describe ownership with lenses, we can use one of the
following clauses:
+ ~consumes x @ t~: states that the function receives ownership of a
  value ~x~ as described by the representation predicate ~t~.
+ ~produces x @ t~: states that the function returns ownership of a
  value ~x~ as described by the representation predicate ~t~.
+ ~modifies x @ t~: states that the function receives and returns
  ownership of a value ~x~ as described by the representation predicate
  ~t~. Note that {{{Gospel}}} treats this clause as syntactic sugar for a
  ~consumes~ and ~produces~ clause.
+ ~preserves x @ t~: states that the function receives and returns
  ownership of a value ~x~ as described by the representation predicate
  ~t~. Note that this is syntactic sugar for a ~produces~ and ~consumes~
  clause coupled with an ~ensures~ clause stating that ~x~ is unchanged.

If no ownership clause is defined for a function argument, then {{{Gospel}}}
assumes a ~preserves~ clause with full ownership. In the case of return
values, we assume a ~produces~ with full ownership.
** Available Lenses
For now, besides the default lens, we only have access to two
lenses:
+ The ~val~ lens, that gives us no ownership of a value
+ The ~loc~ lens, that gives us no ownership of a value, which
  can only be used for mutable values. The reason why there are two
  different lenses that have similar purposes is to specify
  functions that feature physical equality. For example, due to how
  physical equality is defined in {{{OCaml}}}, it may be desirable to define
  it only for the case when it receives two memory locations. To do
  this, we can state:
  #+ATTR_LATEX: :environment ocamlenv
  #+begin_example ocaml
  val ph_eq : 'a -> 'a -> bool
  (*@ ph_eq x y
      preserves x @ loc, y @ loc
      ensures x = y *)
  #+end_example
  This way, this function can only be called with values with which we
  can apply the lens ~loc~, in other words, mutable values.
** Limitations
+ No support for polymorphic lenses, in other words, higher
  order representation predicates.
+ No support for group ownership.
