notes.html
<div id="outline-container-org2cf1d71" class="outline-3">
<h3 id="org2cf1d71">Translation of Type declarations</h3>
<div class="outline-text-3" id="text-org2cf1d71">
<pre class="example" id="orgcf8451c">
type t
(*@ model : int *)
</pre>
<p>
Translates into 
</p>
<pre class="example" id="org17edc60">
Type t
Predicate _T (target : t) (model : int)
</pre>
<pre class="example" id="org240dc91">
type t
(*@ mutable model : int *)
</pre>
<p>
Translates into
</p>
<pre class="example" id="orgf61763d">
Predicate _T (target : loc) (model : int)
</pre>
<pre class="example" id="org6ed81aa">
type t
(*@ model x : int
    model y : int *)
</pre>
<p>
Translates into
</p>
<pre class="example" id="org84ce607">
Type t = {x : int; y : int}
Type _t

Predicate _T (target : t) (model : _t)
</pre>
<pre class="example" id="org8cfca8a">
type t
(*@ mutable model x : int
    model y : int
*)
</pre>
<p>
Translates into
</p>
<pre class="example" id="org3e9b41a">
Type t = {x : int; y : int}
Predicate _T (target : loc) (model : t)
</pre>
</div>
</div>
<div id="outline-container-orgd351f4c" class="outline-3">
<h3 id="orgd351f4c">Implementation</h3>
<div class="outline-text-3" id="text-orgd351f4c">
<ol class="org-ol">
<li>Check if the type has a specification. If so, retrieve the model,
if not, assume the model is a reflection of the OCaml type.</li>
<li>We must check if the type has multiple model fields. If so, we
create an optional value that has the definition of a record type
with all these fields. This type is always marked is
non-mutable. The name of this type is the same as the name of the
original type.</li>
<li>We create a definition of the type. The name of this type depends
if we created a record in the previous step. If so, the name is the
old name with an underscore at the start. Otherwise, the name is
unchanged. For now, we only support abstract types.</li>
<li>We create the definition for the representation predicate. If the
type is mutable, the first argument is of type <code>loc</code>, otherwise, the
first argument is the program type. The next argument is the type's
model, as was defined previously.</li>
</ol>
</div>
</div>
<div id="outline-container-org2efc180" class="outline-3">
<h3 id="org2efc180">Limitations</h3>
<div class="outline-text-3" id="text-org2efc180">
<ul class="org-ul">
<li>When translated into <b>CFML</b>, record fields with names that have
already been defined don't work (Low priority).</li>
<li>No support for polymorphic types with recursive ownership.</li>
<li>No support for concrete type definitions. This can be quite tricky
since in these cases we would need to define an explicit
representation predicate in <b>Gospel</b>, which is not yet possible.
<ul class="org-ul">
<li>Additionally, we must consider the relationship between invariants
and representation predicates.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga257a1b" class="outline-2">
<h2 id="orga257a1b">Value descriptions</h2>
<div class="outline-text-2" id="text-orga257a1b">
<p>
When translating a value description and its specification, we must
take proper care to ensure that all the ownership conditions are
properly generated and are semantically equivalent to their <b>Gospel</b>
counterparts.
</p>
</div>
<div id="outline-container-org3aa6741" class="outline-3">
<h3 id="org3aa6741">Lenses</h3>
<div class="outline-text-3" id="text-org3aa6741">
<p>
To describe ownership of values, we use what are called <i>Lenses</i>;
lightweight notation to encode representation predicates. For example,
let us assume once again a queue whose logical <code>model</code> is a sequence of
integers:
</p>
<pre class="example" id="org91c79e4">
type t
(*@ mutable model : int sequence *)

val push : t -&gt; int -&gt; unit
(*@ f q x
    modifies q
    ensures q = q ++ [x]*)
</pre>
<p>
As I stated in the previous section, the variable <code>q</code> has type <code>int
sequence</code> in the specification. However, in the <b>OCaml</b> interface, it has
type <code>t</code>. To make this transition, we require a representation predicate
(in <b>Gospel</b>'s case, a lens) that lifts the program value into
its logical value. In this case, we could write
</p>
<pre class="example" id="orgc09756a">
val push : t -&gt; int -&gt; unit
(*@ f q x
    modifies q @ t
    ensures ... *)
</pre>
<p>
The <code>modifies</code> clause states that we receive ownership of the <b>OCaml</b>
variable <code>q</code> using the lens <code>t</code> and lift it into the logical type
stated in <code>t</code>'s model, that is, a sequence of integers. When we use the
lens with the same name as the original type (which we will
refer to as the <i>default lens)</i>, we say that we have full
ownership of that value. Additionally, the <code>modifies</code> clause also states
that we return the same ownership of <code>q</code>. Given these semantics, we
could translate this specification into the following Separation Logic
triple (in <b>CFML</b> syntax for simplicity's sake).
</p>
<pre class="example" id="org2939e0d">
forall (prog_q : loc) (q : int list) (x : int)
PRE (prog_q ~&gt; Queue q)
POSTUNIT (prog_q ~&gt; Queue (q ++ [x]))
</pre>
<p>
Important to note that lenses are not exclusive used in
specifications as we see in the Section on <a href="#org2e8ca5d">Logical Quantifiers</a>,
however, we will mostly focus on this use case as it is the most
common as well as the simplest.
</p>
</div>
</div>

<div id="outline-container-org7aa2565" class="outline-3">
<h3 id="org7aa2565">Ownership clauses</h3>
<div class="outline-text-3" id="text-org7aa2565">
<p>
To describe ownership with lenses, we can use one of the
following clauses:
</p>
<ul class="org-ul">
<li><code>consumes x @ t</code>: states that the function receives ownership of a
value <code>x</code> as described by the representation predicate <code>t</code>.</li>
<li><code>produces x @ t</code>: states that the function returns ownership of a
value <code>x</code> as described by the representation predicate <code>t</code>.</li>
<li><code>modifies x @ t</code>: states that the function receives and returns
ownership of a value <code>x</code> as described by the representation predicate
<code>t</code>. Note that <b>Gospel</b> treats this clause as syntactic sugar for a
<code>consumes</code> and <code>produces</code> clause.</li>
<li><code>preserves x @ t</code>: states that the function receives and returns
ownership of a value <code>x</code> as described by the representation predicate
<code>t</code>. Note that this is syntactic sugar for a <code>produces</code> and <code>consumes</code>
clause coupled with an <code>ensures</code> clause stating that <code>x</code> is unchanged.</li>
</ul>

<p>
If no ownership clause is defined for a function argument, then <b>Gospel</b>
assumes a <code>preserves</code> clause with full ownership. In the case of return
values, we assume a <code>produces</code> with full ownership.
</p>
</div>
</div>
<div id="outline-container-org763c5cf" class="outline-3">
<h3 id="org763c5cf">Available Lenses</h3>
<div class="outline-text-3" id="text-org763c5cf">
<p>
For now, besides the default lens, we only have access to two
lenses:
</p>
<ul class="org-ul">
<li>The <code>val</code> lens, that gives us no ownership of a value</li>
<li><p>
The <code>loc</code> lens, that gives us no ownership of a value, which
can only be used for mutable values. The reason why there are two
different lenses that have similar purposes is to specify
functions that feature physical equality. For example, due to how
physical equality is defined in <b>OCaml</b>, it may be desirable to define
it only for the case when it receives two memory locations. To do
this, we can state:
</p>
<pre class="example" id="org1bd45fd">
val ph_eq : 'a -&gt; 'a -&gt; bool
(*@ ph_eq x y
    preserves x @ loc, y @ loc
    ensures x = y *)
</pre>
<p>
This way, this function can only be called with values with which we
can apply the lens <code>loc</code>, in other words, mutable values.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org84fd8df" class="outline-3">
<h3 id="org84fd8df">Limitations</h3>
<div class="outline-text-3" id="text-org84fd8df">
<ul class="org-ul">
<li>No support for polymorphic lenses, in other words, higher
order representation predicates.</li>
<li>No support for group ownership.</li>
</ul>
</div>
</div>
