content/notes.org
** Translations of Lenses
This section will showcase some simple examples of how lenses
are translated into Separation Logic. To showcase, I will show an
example of a stack module, its {{{Gospel}}} specification and its {{{CFML}}}
translation. 
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
type 'a t
(*@ mutable model : 'a Sequence.t *)
#+end_example
Translates into
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter Stack :
forall A {Ih : Inhab A} {EA : Enc A},
sequence A -> loc -> hprop
#+end_example
A few details about this translation:
+ The type definition is omitted in the final {{{Coq}}} code and only the
  representation predicate remains. This is because the type is
  mutable which is not allowed in our Separation Logic
  encoding.
+ When defining the representation predicate, we also state that the
  type argument ~A~ is inhabited, an assumption that {{{Gospel}}}
  makes. Additionally, we also state that the type can be encoded in
  {{{OCaml}}}. The first assumption is made for all type arguments whereas
  the later is only made for type arguments of {{{OCaml}}} functions.
+ The first argument of the predicate is the logical model, the second
  argument is the {{{CFML}}} type for memory locations. Its return is a
  separation logic proposition.
+ The name of the representation predicate (~Stack~) is automatically
  inferred from the module name. 
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
val create : unit -> 'a t
(*@ q = create ()
    ensures q = empty *)
#+end_example
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter _create : CFML.Semantics.val.

Parameter _create_spec:
  forall (A : Type) (Ih : Inhab a) (EA : Enc a),
  SPEC_PURE (_create tt)
    POST (fun _prog_q : loc => _prog_q ~> Stack_cfml empty)
#+end_example
A few more details
+ Since the original specification does not have any ownership clauses
  that reference the return value, we assume ~produces q @ t~. 
+ Just like in the original program, we create an abstract function
  definition as well as a triple.
+ The ~create~ specification returns a variable ~_prog_q~ which is not
  present in the original specification. This is because the ~q~
  return value represents the logical model of the stack, whereas
  ~_prog_q~ represents its memory location, which is not explicitly
  defined in the {{{Gospel}}} side.
+ Interestingly, the ~q~ variable is not present in the generated
  specification. This is because in this case the {{{Gospel}}} specification
  can be captured without it, although there are cases where it must
  be defined via existential quantification.
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
val is_empty : 'a t -> bool
(*@ b = is_empty q
    ensures b <-> q = empty *)
#+end_example
Translates into:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter _is_empty : CFML.Semantics.val.

Parameter _is_empty_spec : 
  forall (A : Type) (IH : Inhab a) (EA : Enc a) 
    (_prog_q : loc) (q : sequence a),
  SPEC (_is_empty _prog_q)
  PRE _prog_q ~> Stack_cfml q
  POST (fun _prog_b : bool =>
        _prog_q ~> Stack_cfml q \* _prog_b ~> Bool (q = empty))
#+end_example
More details:
+ Since the {{{Gospel}}} specification does not have any ownership clauses
  regarding the variable ~q~, we assume ~preserves @ t~.
+ Since the ~q~ variable is unmodified and its ownership is preserved,
  we use the representation predicate in both the pre and post
  conditions to claim ownership.
+ The ~Bool~ representation predicate allows us to jump from the {{{OCaml}}}
  ~bool~ type to the {{{Coq}}} ~Prop~ type.
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
val push : 'a t -> 'a -> unit
(*@ push p x
    modifies p
    ensures p = cons x (old p) *)
#+end_example
Translates into:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter _push : CFML.Semantics.val.

Parameter _push_spec :
  forall (a : Type) (aIh : Inhab a) (Ea : Enc a) 
    (_prog_p : loc) (p : sequence a) (x : a),
  SPEC (_push _prog_p x)
  PRE _prog_p ~> Stack_cfml p
  POSTUNIT _prog_p ~> Stack_cfml (cons x p)
#+end_example
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
val pop : 'a t -> 'a
(*@ r = pop p
    modifies p
    raises Not_found
    checks p <> empty
    ensures (old p) = cons r p *)
#+end_example
Translates into:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter _pop : CFML.Semantics.val.

Parameter _pop_spec :
  forall (a : Type) (aIh : Inhab a) (Ea : Enc a) 
    (_prog_p : loc) (p : sequence a),
  p <> empty ->
  SPEC (_pop _prog_p)
  PRE _prog_p ~> Stack_cfml p
  POST (fun r : a =>
        \exists _p_ : sequence a,
          _prog_p ~> Stack_cfml _p_ \* \[p = cons r _p_])
#+end_example
Some more details:
+ In the postcondition for this spec, we must explicitly lift the
  pointer ~_prog_p~ using an existentially quantified variable.
+ In the original {{{Gospel}}} spec, we have a ~raises~ clause stating that
  the function raises the ~Not_found~ exception, as well as a ~raises~
  clause stating that if the stack is not empty, no exception is
  raised. Since {{{CFML}}} does not support exceptions, we state that the
  generated {{{CFML}}} spec is valid if the stack is not empty.
** <<quant>> Logical Quantifiers
If we wish to state a property universal to an {{{OCaml}}} type that cannot
be captured by an invariant, we might find ourselves using an
axiom. However, if we quantify over an {{{OCaml}}} type, we must apply some
lens in order to access the model of the value. To give an
example, let's assume we wish to state that all queues are non-empty:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
(*@ axiom q_empty : forall q : 'a t, q <> Sequence.empty *)
#+end_example
When translating into Separation Logic, we must ensure that we
correctly apply the representation predicate in order to use its model
to express the desired behaviour. One possible translation is as
follows:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter q_empty :
forall A q_loc (q : sequence A),
  Queue q_loc ~> q -*
  \[q = Sequence.empty] * Queue q_loc ~> q
#+end_example
The general idea is similar to what we saw with specifications: we
create a value of type ~loc~ that describes the memory location of the
{{{OCaml}}} value as well as a value with the logical representation of this
value. We also insert an application of a representation predicate
that describes ownership of the value. One of the few changes is that
now we have a separating implication stating that if we have ownership
of the queue, then we can derive the desired property, all the while
remaining with ownership of the value.
