notes.html
<div id="outline-container-orgf0ca78e" class="outline-3">
<h3 id="orgf0ca78e">Translations of Lenses</h3>
<div class="outline-text-3" id="text-orgf0ca78e">
<p>
This section will showcase some simple examples of how lenses
are translated into Separation Logic. To showcase, I will show an
example of a stack module, its <b>Gospel</b> specification and its <b>CFML</b>
translation. 
</p>
<pre class="example" id="org2e0513a">
type 'a t
(*@ mutable model : 'a Sequence.t *)
</pre>
<p>
Translates into
</p>
<pre class="example" id="orgb937ee4">
Parameter Stack :
forall A {Ih : Inhab A} {EA : Enc A},
sequence A -&gt; loc -&gt; hprop
</pre>
<p>
A few details about this translation:
</p>
<ul class="org-ul">
<li>The type definition is omitted in the final <b>Coq</b> code and only the
representation predicate remains. This is because the type is
mutable which is not allowed in our Separation Logic
encoding.</li>
<li>When defining the representation predicate, we also state that the
type argument <code>A</code> is inhabited, an assumption that <b>Gospel</b>
makes. Additionally, we also state that the type can be encoded in
<b>OCaml</b>. The first assumption is made for all type arguments whereas
the later is only made for type arguments of <b>OCaml</b> functions.</li>
<li>The first argument of the predicate is the logical model, the second
argument is the <b>CFML</b> type for memory locations. Its return is a
separation logic proposition.</li>
<li>The name of the representation predicate (<code>Stack</code>) is automatically
inferred from the module name.</li>
</ul>
<pre class="example" id="org80a4722">
val create : unit -&gt; 'a t
(*@ q = create ()
    ensures q = empty *)
</pre>
<pre class="example" id="org3846157">
Parameter _create : CFML.Semantics.val.

Parameter _create_spec:
  forall (A : Type) (Ih : Inhab a) (EA : Enc a),
  SPEC_PURE (_create tt)
    POST (fun _prog_q : loc =&gt; _prog_q ~&gt; Stack_cfml empty)
</pre>
<p>
A few more details
</p>
<ul class="org-ul">
<li>Since the original specification does not have any ownership clauses
that reference the return value, we assume <code>produces q @ t</code>.</li>
<li>Just like in the original program, we create an abstract function
definition as well as a triple.</li>
<li>The <code>create</code> specification returns a variable <code>_prog_q</code> which is not
present in the original specification. This is because the <code>q</code>
return value represents the logical model of the stack, whereas
<code>_prog_q</code> represents its memory location, which is not explicitly
defined in the <b>Gospel</b> side.</li>
<li>Interestingly, the <code>q</code> variable is not present in the generated
specification. This is because in this case the <b>Gospel</b> specification
can be captured without it, although there are cases where it must
be defined via existential quantification.</li>
</ul>
<pre class="example" id="orgd9331ba">
val is_empty : 'a t -&gt; bool
(*@ b = is_empty q
    ensures b &lt;-&gt; q = empty *)
</pre>
<p>
Translates into:
</p>
<pre class="example" id="org225d0af">
Parameter _is_empty : CFML.Semantics.val.

Parameter _is_empty_spec : 
  forall (A : Type) (IH : Inhab a) (EA : Enc a) 
    (_prog_q : loc) (q : sequence a),
  SPEC (_is_empty _prog_q)
  PRE _prog_q ~&gt; Stack_cfml q
  POST (fun _prog_b : bool =&gt;
        _prog_q ~&gt; Stack_cfml q \* _prog_b ~&gt; Bool (q = empty))
</pre>
<p>
More details:
</p>
<ul class="org-ul">
<li>Since the <b>Gospel</b> specification does not have any ownership clauses
regarding the variable <code>q</code>, we assume <code>preserves @ t</code>.</li>
<li>Since the <code>q</code> variable is unmodified and its ownership is preserved,
we use the representation predicate in both the pre and post
conditions to claim ownership.</li>
<li>The <code>Bool</code> representation predicate allows us to jump from the <b>OCaml</b>
<code>bool</code> type to the <b>Coq</b> <code>Prop</code> type.</li>
</ul>
<pre class="example" id="orged4b852">
val push : 'a t -&gt; 'a -&gt; unit
(*@ push p x
    modifies p
    ensures p = cons x (old p) *)
</pre>
<p>
Translates into:
</p>
<pre class="example" id="orgdc72de8">
Parameter _push : CFML.Semantics.val.

Parameter _push_spec :
  forall (a : Type) (aIh : Inhab a) (Ea : Enc a) 
    (_prog_p : loc) (p : sequence a) (x : a),
  SPEC (_push _prog_p x)
  PRE _prog_p ~&gt; Stack_cfml p
  POSTUNIT _prog_p ~&gt; Stack_cfml (cons x p)
</pre>
<pre class="example" id="orgdbc613c">
val pop : 'a t -&gt; 'a
(*@ r = pop p
    modifies p
    raises Not_found
    checks p &lt;&gt; empty
    ensures (old p) = cons r p *)
</pre>
<p>
Translates into:
</p>
<pre class="example" id="org2850123">
Parameter _pop : CFML.Semantics.val.

Parameter _pop_spec :
  forall (a : Type) (aIh : Inhab a) (Ea : Enc a) 
    (_prog_p : loc) (p : sequence a),
  p &lt;&gt; empty -&gt;
  SPEC (_pop _prog_p)
  PRE _prog_p ~&gt; Stack_cfml p
  POST (fun r : a =&gt;
        \exists _p_ : sequence a,
          _prog_p ~&gt; Stack_cfml _p_ \* \[p = cons r _p_])
</pre>
<p>
Some more details:
</p>
<ul class="org-ul">
<li>In the postcondition for this spec, we must explicitly lift the
pointer <code>_prog_p</code> using an existentially quantified variable.</li>
<li>In the original <b>Gospel</b> spec, we have a <code>raises</code> clause stating that
the function raises the <code>Not_found</code> exception, as well as a <code>raises</code>
clause stating that if the stack is not empty, no exception is
raised. Since <b>CFML</b> does not support exceptions, we state that the
generated <b>CFML</b> spec is valid if the stack is not empty.</li>
</ul>
</div>
</div>
<div id="outline-container-orgecb8372" class="outline-3">
<h3 id="orgecb8372"><a id="org2e8ca5d"></a> Logical Quantifiers</h3>
<div class="outline-text-3" id="text-orgecb8372">
<p>
If we wish to state a property universal to an <b>OCaml</b> type that cannot
be captured by an invariant, we might find ourselves using an
axiom. However, if we quantify over an <b>OCaml</b> type, we must apply some
lens in order to access the model of the value. To give an
example, let's assume we wish to state that all queues are non-empty:
</p>
<pre class="example" id="org10cd7d0">
(*@ axiom q_empty : forall q : 'a t, q &lt;&gt; Sequence.empty *)
</pre>
<p>
When translating into Separation Logic, we must ensure that we
correctly apply the representation predicate in order to use its model
to express the desired behaviour. One possible translation is as
follows:
</p>
<pre class="example" id="orgd1af036">
Parameter q_empty :
forall A q_loc (q : sequence A),
  Queue q_loc ~&gt; q -*
  \[q = Sequence.empty] * Queue q_loc ~&gt; q
</pre>
<p>
The general idea is similar to what we saw with specifications: we
create a value of type <code>loc</code> that describes the memory location of the
<b>OCaml</b> value as well as a value with the logical representation of this
value. We also insert an application of a representation predicate
that describes ownership of the value. One of the few changes is that
now we have a separating implication stating that if we have ownership
of the queue, then we can derive the desired property, all the while
remaining with ownership of the value.
</p>
</div>
</div>
</div>
