content/notes.org
* ~Prop~ and ~Bool~
In current {{{Gospel}}}, there is an internal distinction made between
booleans and propositions, although this distinction is not made
apparent to users. As part of my work, I have changed the {{{Gospel}}}
type checker so that this distinction is not made. This makes
translations into {{{CFML}}} a bit trickier since {{{Coq}}} does make an explicit
distinction between the two. For example:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
function ex (x : bool) (y : bool) =
    true -> x && y
#+end_example
If we were to translate this term verbatim into {{{Coq}}} we would get a
typing error, since the terms ~true~ and ~x && y~ evaluate to booleans
and the {{{Coq}}} implications require values of type ~Prop~. The simplest way
to solve this is by normalizing the resulting {{{Coq}}} program so that all
booleans and boolean related operations are translated into either
~Prop~ or ~bool~. We chose the former since it makes proofs easier to
write, seeing as if all the variables were booleans, we would have to
frequently make explicit conversions to ~Prop~. The downside is that
some cases require somewhat verbose conversions from ~Prop~ to ~bool~.

** How the translation is done:
Most cases are quite straightforward: any function arguments of type
~bool~ are turned into ~Prop~ and all built in logical symbols are translated
into ~Coq~ equivalents that operate on the ~Prop~ type. There are a few
details however worth noting:

*** Equality
In {{{Gospel}}} the proposition ~p1 = p2 <-> p1 <-> p2~ for all ~p1~ and
~p2~. However, in {{{Coq}}}, since we are targeting the ~Prop~ type, this is not
valid. Conveniently, {{{CFML}}} uses {{{TLC}}}, which assumes the propositional
extensionality, meaning that the statement above is valid without any
extra configuration. {{{Iris}}} could still be problematic if propositional
extensionality is not assumed.
*** Pattern Matching
Pattern matching over ~Prop~ is impossible in {{{Coq}}}, meaning that we must
modify {{{Gospel}}} expressions that use boolean pattern matching so that it
is valid in {{{Coq}}}. Assuming an expression ~match e with ...~, when we
translate into {{{Coq}}}, ~e~ will be of type ~Prop~, meaning we must first
transform it into a ~bool~. For example:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
match true || false with ...
#+end_example
Is translated to:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
match Prop_to_bool (True \/ False) with ...
#+end_example
In the case where the pattern is a variable name, then we have to
redefine a new variable with the same name but of type ~Prop~. For
example:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
match true with
|x ->  x -> true
#+end_example
Is Translated To:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
match Prop_to_bool True with
|_x -> let x := Prop_to_bool _x in x -> true
end
#+end_example
*** Program Variables
When we have an {{{OCaml}}} function that receives an argument of type ~bool~,
we cannot simply transform it into an argument of type ~Prop~ seeing as
{{{CFML}}} would require an encoder for the ~Prop~ type which cannot
exist. Therefore it must remain of type ~bool~, and within the spec must
be turned into a Prop. For example:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
val flip : bool -> bool
(*@ r = flip b
    ensures r <-> b *)
#+end_example
Translates to:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
forall (_prog_b : bool) (b : Prop),
SPEC(flip _prog_b)
PRE(_prog_b ~> Bool b)
POST(fun _prog_r : bool -> _prog_r ~> Bool b)
#+end_example
*** Bazinga
Turns out this is all bad and we should keep the internal distinction ðŸ¤·
* Gospel Type Semantics
The semantics of our Separation Logic translation are fairly
straightforward, it has triples, axioms, functions and representation
predicates. However, since the typing discipline is not as obvious, I
will give a little bit of context.

All type declarations are pure in the intermediate
representation. When we are faced with an {{{OCaml}}} type that has a
mutable model field, this type disappears from the intermediate
representation, being subsumed into the ~loc~ type. Additionally, within
{{{Gospel}}} terms, the user is never allows to refer to any fields or
constructors within the {{{OCaml}}} type and is only allowed to talk about
its logical ~model~, even if the type is pure (unless, of course, if the
model is a reflection of the {{{OCaml}}} type as described in Section [[ ep][Pure
Annotations]].). If at some point we find it useful to talk about
OCaml values in {{{Gospel}}} terms (e.g. representation predicates) these
semantics might have to be adjusted. One possibility would be to add
"field" declarations similar to what {{{Viper}}} does. This way, we remain
only with pure types but with each of the fields declared.

Additionally, all types are assumed to be inhabited. At the moment,
{{{Gospel}}} does not support any construct to create empty types, meaning
it is impossible to generate any inconsistencies.

* Higher order lenses
Currently, lenses are first order, meaning we cannot claim
recursive ownership of polymorphic data types. This greatly limits
their usefulness since we can basically only use them to choose if we
want to claim ownership of a mutable data structure or not. If we
allowed lenses to be higher order, we could capture in our
specs, for example, containers that store mutable values. This way we
greatly increase the amount of programs {{{Gospel}}} can specify as well as
allowing for a higher level of granularity when describing ownership
conditions.

* Lemmas
Translating lemmas into 
The tricky part is that when we translate terms from Separation Logic
into {{{CFML}}}, we transform them into values of type ~hprop~. This means
that {{{Coq}}} will not require the user to prove that their axioms are
sound. To remedy this, we translate axioms as follows:
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
(*@ axiom A : P *)
#+end_example
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter A : \[] ==> \[P]
#+end_example
Since ~A~ is now a ~Prop~, {{{Coq}}} will now require that the user prove its
correctness. Although this will work if the only ownership clauses
refer to variables defined within the lemma, since these only generate
conditions where ownership is only claimed on the left hand side of a
magic wand (see previous section), this will not work if the axiom
refers to global variables.

* Open Questions
