notes.html
<div id="outline-container-org391cddc" class="outline-2">
<h2 id="org391cddc"><code>Prop</code> and <code>Bool</code></h2>
<div class="outline-text-2" id="text-org391cddc">
<p>
In current <b>Gospel</b>, there is an internal distinction made between
booleans and propositions, although this distinction is not made
apparent to users. As part of my work, I have changed the <b>Gospel</b>
type checker so that this distinction is not made. This makes
translations into <b>CFML</b> a bit trickier since <b>Coq</b> does make an explicit
distinction between the two. For example:
</p>
<pre class="example" id="org965d9cd">
function ex (x : bool) (y : bool) =
    true -&gt; x &amp;&amp; y
</pre>
<p>
If we were to translate this term verbatim into <b>Coq</b> we would get a
typing error, since the terms <code>true</code> and <code>x &amp;&amp; y</code> evaluate to booleans
and the <b>Coq</b> implications require values of type <code>Prop</code>. The simplest way
to solve this is by normalizing the resulting <b>Coq</b> program so that all
booleans and boolean related operations are translated into either
<code>Prop</code> or <code>bool</code>. We chose the former since it makes proofs easier to
write, seeing as if all the variables were booleans, we would have to
frequently make explicit conversions to <code>Prop</code>. The downside is that
some cases require somewhat verbose conversions from <code>Prop</code> to <code>bool</code>.
</p>
</div>

<div id="outline-container-org69bffcd" class="outline-3">
<h3 id="org69bffcd">How the translation is done:</h3>
<div class="outline-text-3" id="text-org69bffcd">
<p>
Most cases are quite straightforward: any function arguments of type
<code>bool</code> are turned into <code>Prop</code> and all built in logical symbols are translated
into <code>Coq</code> equivalents that operate on the <code>Prop</code> type. There are a few
details however worth noting:
</p>
</div>

<div id="outline-container-org4d4b2db" class="outline-4">
<h4 id="org4d4b2db">Equality</h4>
<div class="outline-text-4" id="text-org4d4b2db">
<p>
In <b>Gospel</b> the proposition <code>p1 = p2 &lt;-&gt; p1 &lt;-&gt; p2</code> for all <code>p1</code> and
<code>p2</code>. However, in <b>Coq</b>, since we are targeting the <code>Prop</code> type, this is not
valid. Conveniently, <b>CFML</b> uses <b>TLC</b>, which assumes the propositional
extensionality, meaning that the statement above is valid without any
extra configuration. <b>Iris</b> could still be problematic if propositional
extensionality is not assumed.
</p>
</div>
</div>
<div id="outline-container-org1d63437" class="outline-4">
<h4 id="org1d63437">Pattern Matching</h4>
<div class="outline-text-4" id="text-org1d63437">
<p>
Pattern matching over <code>Prop</code> is impossible in <b>Coq</b>, meaning that we must
modify <b>Gospel</b> expressions that use boolean pattern matching so that it
is valid in <b>Coq</b>. Assuming an expression <code>match e with ...</code>, when we
translate into <b>Coq</b>, <code>e</code> will be of type <code>Prop</code>, meaning we must first
transform it into a <code>bool</code>. For example:
</p>
<pre class="example" id="orgdbaad1e">
match true || false with ...
</pre>
<p>
Is translated to:
</p>
<pre class="example" id="org68e4cfc">
match Prop_to_bool (True \/ False) with ...
</pre>
<p>
In the case where the pattern is a variable name, then we have to
redefine a new variable with the same name but of type <code>Prop</code>. For
example:
</p>
<pre class="example" id="orgd7db2ed">
match true with
|x -&gt;  x -&gt; true
</pre>
<p>
Is Translated To:
</p>
<pre class="example" id="orgc649c0c">
match Prop_to_bool True with
|_x -&gt; let x := Prop_to_bool _x in x -&gt; true
end
</pre>
</div>
</div>
<div id="outline-container-org9b37c5f" class="outline-4">
<h4 id="org9b37c5f">Program Variables</h4>
<div class="outline-text-4" id="text-org9b37c5f">
<p>
When we have an <b>OCaml</b> function that receives an argument of type <code>bool</code>,
we cannot simply transform it into an argument of type <code>Prop</code> seeing as
<b>CFML</b> would require an encoder for the <code>Prop</code> type which cannot
exist. Therefore it must remain of type <code>bool</code>, and within the spec must
be turned into a Prop. For example:
</p>
<pre class="example" id="org4bad33c">
val flip : bool -&gt; bool
(*@ r = flip b
    ensures r &lt;-&gt; b *)
</pre>
<p>
Translates to:
</p>
<pre class="example" id="orgd7c59d2">
forall (_prog_b : bool) (b : Prop),
SPEC(flip _prog_b)
PRE(_prog_b ~&gt; Bool b)
POST(fun _prog_r : bool -&gt; _prog_r ~&gt; Bool b)
</pre>
</div>
</div>
<div id="outline-container-orge1a6f8a" class="outline-4">
<h4 id="orge1a6f8a">Bazinga</h4>
<div class="outline-text-4" id="text-orge1a6f8a">
<p>
Turns out this is all bad and we should keep the internal distinction ðŸ¤·
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbf9eec7" class="outline-2">
<h2 id="orgbf9eec7">Gospel Type Semantics</h2>
<div class="outline-text-2" id="text-orgbf9eec7">
<p>
The semantics of our Separation Logic translation are fairly
straightforward, it has triples, axioms, functions and representation
predicates. However, since the typing discipline is not as obvious, I
will give a little bit of context.
</p>

<p>
All type declarations are pure in the intermediate
representation. When we are faced with an <b>OCaml</b> type that has a
mutable model field, this type disappears from the intermediate
representation, being subsumed into the <code>loc</code> type. Additionally, within
<b>Gospel</b> terms, the user is never allows to refer to any fields or
constructors within the <b>OCaml</b> type and is only allowed to talk about
its logical <code>model</code>, even if the type is pure (unless, of course, if the
model is a reflection of the <b>OCaml</b> type as described in Section <a href="#org40f82ff">Pure
Annotations</a>.). If at some point we find it useful to talk about
OCaml values in <b>Gospel</b> terms (e.g. representation predicates) these
semantics might have to be adjusted. One possibility would be to add
"field" declarations similar to what <b>Viper</b> does. This way, we remain
only with pure types but with each of the fields declared.
</p>

<p>
Additionally, all types are assumed to be inhabited. At the moment,
<b>Gospel</b> does not support any construct to create empty types, meaning
it is impossible to generate any inconsistencies.
</p>
</div>
</div>

<div id="outline-container-org803c5c3" class="outline-2">
<h2 id="org803c5c3">Higher order lenses</h2>
<div class="outline-text-2" id="text-org803c5c3">
<p>
Currently, lenses are first order, meaning we cannot claim
recursive ownership of polymorphic data types. This greatly limits
their usefulness since we can basically only use them to choose if we
want to claim ownership of a mutable data structure or not. If we
allowed lenses to be higher order, we could capture in our
specs, for example, containers that store mutable values. This way we
greatly increase the amount of programs <b>Gospel</b> can specify as well as
allowing for a higher level of granularity when describing ownership
conditions.
</p>
</div>
</div>

<div id="outline-container-org82724a0" class="outline-2">
<h2 id="org82724a0">Lemmas</h2>
<div class="outline-text-2" id="text-org82724a0">
<p>
Translating lemmas into 
The tricky part is that when we translate terms from Separation Logic
into <b>CFML</b>, we transform them into values of type <code>hprop</code>. This means
that <b>Coq</b> will not require the user to prove that their axioms are
sound. To remedy this, we translate axioms as follows:
</p>
<pre class="example" id="org3434aa2">
(*@ axiom A : P *)
</pre>
<pre class="example" id="orga8e982d">
Parameter A : \[] ==&gt; \[P]
</pre>
<p>
Since <code>A</code> is now a <code>Prop</code>, <b>Coq</b> will now require that the user prove its
correctness. Although this will work if the only ownership clauses
refer to variables defined within the lemma, since these only generate
conditions where ownership is only claimed on the left hand side of a
magic wand (see previous section), this will not work if the axiom
refers to global variables.
</p>
</div>
</div>
