content/notes.org
** Impure Types in Logical Terms
As stated previously, when we have a type with multiple ~model~
fields, we create in our intermediate representation a record type
with each field. This record type will then be the model for this
type. However, with the {{{Gospel}}} specification, this type does not
exist, which leaves us with the following question: in the following case:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
type t = {ocaml_x : int; ocaml_y : int}
(*@ mutable model x : int
    mutable model y : int *)

val f : t -> unit
(*@ f arg
    ensures arg.x = arg.y *)
#+end_example
What is the type of ~arg~ within the specification? The clearest answer
would be that it is of type ~t~, however, type ~t~ is an {{{OCaml}}} type. This
is problematic since these may only be used in specifications when
they are pure. Current {{{Gospel}}} allows users to refer to the model
fields and the program fields within the spec. I changed this so that
internally, ~arg~ is of type ~t~, but the user is only allowed to access
the model fields ~x~ and ~y~ and not the fields ~ocaml_x~ and ~ocaml_y~. This
way, there is a clear divide between the {{{OCaml}}} and the {{{Gospel}}}
world. Additionally, users may still refer to the model of ~t~ in
situations such as:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
(*@ predicate test (arg : t) =
    arg.x = arg.y *)
#+end_example
This might be inadequate when we add representation predicates in
{{{Gospel}}} which will require us to access their program fields. A few
alternatives to this would be:

+ Disallow named model fields and require the user to create an
  explicit ghost record type (seems annoying).
+ Have some special name for the model of ~t~, (seems annoying to
  program since finding a naming convention that is both clear and
  does not clash with any other names would be quite tricky. Also
  seems annoying on the user side that they have to write the name of
  a type that does not exist explicitly in the spec)


TODO:
duplicable definition (only needed for CFML)
Lemma duplicable : 
       forall s m,
       Duplicable (s ~> pstack m). 
       
s ~> pstack m ==> s ~> pstack m * s ~> pstack m
** Recursive Ownership of Elements

Currently in Gospel, we have to way of describing recursive ownership
of data structures with mutable elements.
*** The Problem
If we wished to specify, for example, a stack where its elements could
be impure, we would like to have a {{{Gospel}}} specification such as:
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
type 'a t
(*@ model : 'a sequence *)

val peek : 'a t -> 'a
(*@ r = pop q
    requires q <> empty
    preserves q @ 'a t
    produces r @ 'a
    ensures r = hd q *)
#+end_example

If we assume that ~'a~ can be a mutable value, then our translation into
Separation Logic should look like:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
Parameter Stack : {A} {B} `{Enc A} (l : loc)
              (HO: A -> B -> hprop) (model : sequence A).

Parameter peek_spec :
forall A `{Enc A} q_loc HO q,
PRE(Stack q_loc HO q)
CODE(peek s)
POST(r_loc => exists r,
       HO r_loc r * Stack q_loc HO q * \[hd q = r])           
#+end_example
Although this makes intuitive sense, it is unsound, seeing as we are
duplicating the permission for the value stored in ~r_loc~.

*** Magic Wand (in Gospel)
There are a few possibilities to circumvent this issue. The most
obvious is using the magic wand: in the Gospel spec we could have
something along the lines of:
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
val get : 'a ref -> 'a
(*@ v = get r
    consumes r @ 'a t
    produces v @ 'a
    produces r @ val t until r *)
#+end_example
The final ~produces~ clause would mean, intuitively, that we return ~q~
with no ownership of its elements. The ~until~ operator(?) signifies
that when ownership of ~r~, as described in the first ~produces~ clause,
has been surrendered we regain ownership of ~q~ as is described in the
~consumes~ clause. The post condition of the previous specification
would now look something like:
#+ATTR_LATEX: :environment cfml
#+begin_example coq
forall A `{Enc A} q_loc HO q,
POST(r_loc => exists r,
       HO r_loc r * Stack q_loc val q * \[hd q = r] *
       (HO r_loc r *-> Stack q_loc HO q)
       )
#+end_example
* Exceptional Specifications
With the addition of ownership clauses in {{{Gospel}}}, we also need a way
of describing ownership in cases of exceptional termination. The
simplest (and indeed the most common case) is when we return full
ownership of the data structure.
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
val pop : 'a t -> 'a
(*@ r = pop p
    modifies p
    raises Not_found begin
      produces p
      ensures p = old p = empty
    end
    ensures r = hd (old p)
    ensures p = tl (old p) *)
#+end_example
** Problems with ownership clauses
In the nested specification, we state that we return full ownership of
~p~ as well as stating that ~p~ is unchanged and is equal to the ~empty~
sequence. Since this is an exceptional condition, ~ensures~ and ~produces~
are the only clauses that make sense to use. A few things about this
specification are not ideal. Specifically, having to explicitly write
~produces~ and that the data structure is not modified can be a bit
heavy. There are a few possible way to remedy this, none of them are
fully satisfying:

- We could allow the use of the ~preserves~ clause within exceptional
  postconditions and assume it to be the default. This is not ideal
  since ~preserves~ is syntactic sugar for a ~produces~ and a ~consumes~ and
  as I have stated, it does not make sense to have a ~produces~ within
  exceptional postconditions. We could have it so a ~preserves~ clause
  has a different semantics when used within an exceptional
  specification. From a user perspective this is not that bad since it
  is an intuitive use of the ~preserves~ clause. However, having it mean
  something different based on context makes the semantics a bit
  messy. (The more I think about this, the more I prefer this
  solution. Although this means that the desugaring of ~preserves~ is
  context dependent, it makes intuitive sense and does not break
  things in a fundemental way).
  
- We could have a default which states that if no ownership clause is
  given then we assume we return the same ownership that we receive,
  that is, the exceptional ~produces~ clause is the same as the
  non-exceptional ~consumes~ clause. Additionally, we would also assume
  an ensures clause stating that the variable is unchanged. This is
  also not ideal because it would make it so ~produces~ clauses of
  exceptional specifications have a different default than

- We could have a default that if no ownership clause is given then we
  assume the non-exceptional ~produces~ clause.

