notes.html

<div id="outline-container-org4cfaefc" class="outline-2">
<h2 id="org4cfaefc">Open Questions</h2>
<div class="outline-text-2" id="text-org4cfaefc">
</div>
<div id="outline-container-orgf196025" class="outline-3">
<h3 id="orgf196025">Impure Types in Logical Terms</h3>
<div class="outline-text-3" id="text-orgf196025">
<p>
As stated previously, when we have a type with multiple <code>model</code>
fields, we create in our intermediate representation a record type
with each field. This record type will then be the model for this
type. However, with the <b>Gospel</b> specification, this type does not
exist, which leaves us with the following question: in the following case:
</p>
<pre class="example" id="orgcfad727">
type t = {ocaml_x : int; ocaml_y : int}
(*@ mutable model x : int
    mutable model y : int *)

val f : t -&gt; unit
(*@ f arg
    ensures arg.x = arg.y *)
</pre>
<p>
What is the type of <code>arg</code> within the specification? The clearest answer
would be that it is of type <code>t</code>, however, type <code>t</code> is an <b>OCaml</b> type. This
is problematic since these may only be used in specifications when
they are pure. Current <b>Gospel</b> allows users to refer to the model
fields and the program fields within the spec. I changed this so that
internally, <code>arg</code> is of type <code>t</code>, but the user is only allowed to access
the model fields <code>x</code> and <code>y</code> and not the fields <code>ocaml_x</code> and <code>ocaml_y</code>. This
way, there is a clear divide between the <b>OCaml</b> and the <b>Gospel</b>
world. Additionally, users may still refer to the model of <code>t</code> in
situations such as:
</p>
<pre class="example" id="orgc9b71d9">
(*@ predicate test (arg : t) =
    arg.x = arg.y *)
</pre>
<p>
This might be inadequate when we add representation predicates in
<b>Gospel</b> which will require us to access their program fields. A few
alternatives to this would be:
</p>

<ul class="org-ul">
<li>Disallow named model fields and require the user to create an
explicit ghost record type (seems annoying).</li>
<li>Have some special name for the model of <code>t</code>, (seems annoying to
program since finding a naming convention that is both clear and
does not clash with any other names would be quite tricky. Also
seems annoying on the user side that they have to write the name of
a type that does not exist explicitly in the spec)</li>
</ul>


<p>
TODO:
duplicable definition (only needed for CFML)
Lemma duplicable : 
       forall s m,
       Duplicable (s ~&gt; pstack m). 
</p>

<p>
s ~&gt; pstack m ==&gt; s ~&gt; pstack m * s ~&gt; pstack m
</p>
</div>
</div>
<div id="outline-container-org29431a2" class="outline-3">
<h3 id="org29431a2">Recursive Ownership of Elements</h3>
<div class="outline-text-3" id="text-org29431a2">
<p>
Currently in Gospel, we have to way of describing recursive ownership
of data structures with mutable elements.
</p>
</div>
<div id="outline-container-org72e2513" class="outline-4">
<h4 id="org72e2513">The Problem</h4>
<div class="outline-text-4" id="text-org72e2513">
<p>
If we wished to specify, for example, a stack where its elements could
be impure, we would like to have a <b>Gospel</b> specification such as:
</p>
<pre class="example" id="org1868895">
type 'a t
(*@ model : 'a sequence *)

val peek : 'a t -&gt; 'a
(*@ r = pop q
    requires q &lt;&gt; empty
    preserves q @ 'a t
    produces r @ 'a
    ensures r = hd q *)
</pre>

<p>
If we assume that <code>'a</code> can be a mutable value, then our translation into
Separation Logic should look like:
</p>
<pre class="example" id="org58abc79">
Parameter Stack : {A} {B} `{Enc A} (l : loc)
              (HO: A -&gt; B -&gt; hprop) (model : sequence A).

Parameter peek_spec :
forall A `{Enc A} q_loc HO q,
PRE(Stack q_loc HO q)
CODE(peek s)
POST(r_loc =&gt; exists r,
       HO r_loc r * Stack q_loc HO q * \[hd q = r])           
</pre>
<p>
Although this makes intuitive sense, it is unsound, seeing as we are
duplicating the permission for the value stored in <code>r_loc</code>.
</p>
</div>
</div>

<div id="outline-container-orgdbefefa" class="outline-4">
<h4 id="orgdbefefa">Magic Wand (in Gospel)</h4>
<div class="outline-text-4" id="text-orgdbefefa">
<p>
There are a few possibilities to circumvent this issue. The most
obvious is using the magic wand: in the Gospel spec we could have
something along the lines of:
</p>
<pre class="example" id="orgf958118">
val get : 'a ref -&gt; 'a
(*@ v = get r
    consumes r @ 'a t
    produces v @ 'a
    produces r @ val t until r *)
</pre>
<p>
The final <code>produces</code> clause would mean, intuitively, that we return <code>q</code>
with no ownership of its elements. The <code>until</code> operator(?) signifies
that when ownership of <code>r</code>, as described in the first <code>produces</code> clause,
has been surrendered we regain ownership of <code>q</code> as is described in the
<code>consumes</code> clause. The post condition of the previous specification
would now look something like:
</p>
<pre class="example" id="orgacf4b1f">
forall A `{Enc A} q_loc HO q,
POST(r_loc =&gt; exists r,
       HO r_loc r * Stack q_loc val q * \[hd q = r] *
       (HO r_loc r *-&gt; Stack q_loc HO q)
       )
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9684506" class="outline-2">
<h2 id="org9684506">Exceptional Specifications</h2>
<div class="outline-text-2" id="text-org9684506">
<p>
With the addition of ownership clauses in <b>Gospel</b>, we also need a way
of describing ownership in cases of exceptional termination. The
simplest (and indeed the most common case) is when we return full
ownership of the data structure.
</p>
<pre class="example" id="org1fe186c">
val pop : 'a t -&gt; 'a
(*@ r = pop p
    modifies p
    raises Not_found begin
      produces p
      ensures p = old p = empty
    end
    ensures r = hd (old p)
    ensures p = tl (old p) *)
</pre>
</div>
<div id="outline-container-orgcedb800" class="outline-3">
<h3 id="orgcedb800">Problems with ownership clauses</h3>
<div class="outline-text-3" id="text-orgcedb800">
<p>
In the nested specification, we state that we return full ownership of
<code>p</code> as well as stating that <code>p</code> is unchanged and is equal to the <code>empty</code>
sequence. Since this is an exceptional condition, <code>ensures</code> and <code>produces</code>
are the only clauses that make sense to use. A few things about this
specification are not ideal. Specifically, having to explicitly write
<code>produces</code> and that the data structure is not modified can be a bit
heavy. There are a few possible way to remedy this, none of them are
fully satisfying:
</p>

<ul class="org-ul">
<li>We could allow the use of the <code>preserves</code> clause within exceptional
postconditions and assume it to be the default. This is not ideal
since <code>preserves</code> is syntactic sugar for a <code>produces</code> and a <code>consumes</code> and
as I have stated, it does not make sense to have a <code>produces</code> within
exceptional postconditions. We could have it so a <code>preserves</code> clause
has a different semantics when used within an exceptional
specification. From a user perspective this is not that bad since it
is an intuitive use of the <code>preserves</code> clause. However, having it mean
something different based on context makes the semantics a bit
messy. (The more I think about this, the more I prefer this
solution. Although this means that the desugaring of <code>preserves</code> is
context dependent, it makes intuitive sense and does not break
things in a fundemental way).</li>

<li>We could have a default which states that if no ownership clause is
given then we assume we return the same ownership that we receive,
that is, the exceptional <code>produces</code> clause is the same as the
non-exceptional <code>consumes</code> clause. Additionally, we would also assume
an ensures clause stating that the variable is unchanged. This is
also not ideal because it would make it so <code>produces</code> clauses of
exceptional specifications have a different default than</li>

<li>We could have a default that if no ownership clause is given then we
assume the non-exceptional <code>produces</code> clause.</li>
</ul>
</div>
</div>
