content/notes.org
** Changes to the Gospel syntax
There are now three ways to write exceptional postconditions:
- A list comma separated identifiers
  #+ATTR_LATEX: :environment gospel
  #+begin_example ocaml
  raises E1, E2, E3
  #+end_example
- A nested specification where the only valid clauses are ~produces~ and
  ~ensures~. The values ~x1 x2 ...~ are the exception's arguments,
  these may be omitted.
  #+ATTR_LATEX: :environment gospel
  #+begin_example ocaml
  raises E (x1, x2 ..) begin
    produces ...
    ensures ...
  end
  #+end_example
- A single exceptional postcondition.
  #+ATTR_LATEX: :environment gospel
  #+begin_example ocaml
  raises E (x1, x2, ...) -> P
  #+end_example
  Which is just sugar for
  #+ATTR_LATEX: :environment gospel
  #+begin_example ocaml
  raises E (x1, x2 ...) begin
    ensures P
  end
  #+end_example
In the latter two cases , all exceptional return values have to be named
(i.e.) no wildcards are allowed, similar to what {{{Gospel}}} requires with
regards to normal return values (either they are all named or none are
named).

* TODO Functor Constraints
Just like we can add constraints to {{{OCaml}}} functor applications, we
should also be allowed to add additional {{{Gospel}}} constraints. For
example:
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
module Make 
  (H : HashedType)
  (S : SENTINELS with type t = H.t)
  : SET with type element = H.t
  (*@ with predicate equiv = H.equiv and
           function  tomb = S.tomb   and
           function  void = S.void 
           *)
#+end_example
* Updated syntax

In Gospel there is no way to talk about ownership of values when an
exception is raised. To this end, we propose an updated syntax to
allow users to write multiple specifications for each possible raised
exception. 

Currently, Gospel specifications start with a header where we define
the names of the arguments and return values, which is then followed
up with pre and postconditions and other clauses. Our proposal is to
have an alternate syntax where the header appears after clauses that
describe the program state before the function is called (requires,
consumes, etc) and before clauses that describe the state after the
function returns. For example, the specification for a pop function of
a queue would be written as:
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml

     val pop : 'a queue -> 'a
     (*@ consumes q
         requires not (empty q)
         let x = pop q in
         produces q
         ensures x :: q = old q *)
#+end_example
A peculiarity of this representation is that the function's
arguments are used before they are named in the function
call. This is similar to what Gospel does currently, where free
variables used in the function call are assumed to be universally
quantified, but a bit more non-standard.

In the special case where there are no exceptional clauses, the syntax
would be similar, but with no ~in~.
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
val pop : 'a queue -> 'a
(*@ requires q <> empty
    let x = pop q in *)
#+end_example
In the case of a function that may raise some exception, we would use
a match to describe its behavior in the normal case and the
exceptional case. For example, if we wish to describe the pop function
without using the precondition not (empty q) and instead with an
exceptional postcondition.
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
  val pop : 'a queue -> 'a
  (*@ consumes q
      match find q p with
      |exception Not_found ->
         produces q
         ensures p = old p = Sequence.empty
      |r ->
         produces q
         ensures x :: q = old q *)
#+end_example
In this case, since we consume q and produce it in the exceptional and
non-exceptional specifications, we can use a modifies clause which is
sugar for a consumes and a produces in every postcondition.
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
    val pop : 'a queue -> 'a
    (*@ modifies q
        match find q p with
        |exception Not_found ->
           ensures p = old p = Sequence.empty
        |r ->
           ensures x :: q = old q *)
#+end_example
Naturally, integrating these changes would deprecate the current Gospel
syntax for specifications.

* Shared Resources

There is currently no way of capturing shared permissions in Gospel,
all values are exclusively owned by the functions that use them. To
solve this, we could take inspiration from the [[https://dl.acm.org/doi/10.1145/3622798][Leaf]] library and add a
notion of resources guarding other resources.

In Leaf, the authors introduce the â¤” operator where G â¤” P means that
the resource G guards the resource P. In other words, we can exchange
exclusive ownership of resource G to obtain shared ownership of a
resource G. 

** Mutex example (monomorphic)
Specification for a mutually exclusive lock that protects a single
reference.
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
type mutex
(*@ model protectee : loc *)

val create : unit -> mutex
(*@ consumes s @ int ref
    create [s : int ref] *)

val lock : mutex -> unit
(*@ lock m
    produces m @ acquired (* not strictly nec*)
    produces m.protectee @ int ref *)

val unlock : mutex -> unit
(*@ consumes m.protectee @ int ref
    consumes m @ acquired
    unlock m *)

val try_lock : mutex -> bool
(*@ let b = lock m in
    produces b -> m.protectee @ int ref *)
#+end_example
** Mutex example
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
type (*@ 's *) mutex

(*@ affine lens acquired (m : 's mutex) *)

val create : unit -> (*@ 's *) mutex
(*@ consumes 's
    create () *)

val lock : (*@ 's *) mutex -> unit
(*@ lock m
    produces 's *)

val unlock : (*@ 's *) mutex -> unit
(*@ consumes 's
    unlock m *)

val try_lock : (*@ 's *) mutex -> bool
(*@ try_lock m
    produces b -> 's *)
#+end_example
** Explicitly guarded mutex
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
type 'a mutex

type 'a guard
(*@ ephemeral *)

val create : 'a -> 'a mutex
(*@ consumes s 
    create s *)

val lock : 'a mutex -> 'a guard
(*@ g = lock m *)

val unlock : 'a guard -> unit
(*@ consumes g @ 'a guard
    unlock g *)

val peek : 'a guard -> 'a
(*@ s = peek g
    produces g @ 'a guard <-> s @ 'a *)
#+end_example
** Explicitly guarded mutex v2
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
type 'a mutex

type 'a guard

val create : 'a -> 'a mutex
(*@ consumes s 
    create s *)

val lock : 'a mutex -> 'a guard
(*@ g = lock m *)

val unlock : 'a guard -> unit
(*@ consumes l @ 'a guard
    unlock l *)

val peek : 'a guard -> 'a
(*@ s = peek g
    produces g @ 'a guard == s @ 'a *)

val try_lock : (*@ 's *) mutex -> bool
(*@ try_lock m
    produces b -> 's *)
#+end_example
