notes.html

<div id="outline-container-orgf1be234" class="outline-3">
<h3 id="orgf1be234">Changes to the Gospel syntax</h3>
<div class="outline-text-3" id="text-orgf1be234">
<p>
There are now three ways to write exceptional postconditions:
</p>
<ul class="org-ul">
<li><p>
A list comma separated identifiers
</p>
<pre class="example" id="org093b915">
raises E1, E2, E3
</pre></li>
<li><p>
A nested specification where the only valid clauses are <code>produces</code> and
<code>ensures</code>. The values <code>x1 x2 ...</code> are the exception's arguments,
these may be omitted.
</p>
<pre class="example" id="org1ec1fff">
raises E (x1, x2 ..) begin
  produces ...
  ensures ...
end
</pre></li>
<li><p>
A single exceptional postcondition.
</p>
<pre class="example" id="org040211b">
raises E (x1, x2, ...) -&gt; P
</pre>
<p>
Which is just sugar for
</p>
<pre class="example" id="orgedcb8d6">
raises E (x1, x2 ...) begin
  ensures P
end
</pre></li>
</ul>
<p>
In the latter two cases , all exceptional return values have to be named
(i.e.) no wildcards are allowed, similar to what <b>Gospel</b> requires with
regards to normal return values (either they are all named or none are
named).
</p>
</div>
</div>
</div>

<div id="outline-container-org798ee8f" class="outline-2">
<h2 id="org798ee8f"><span class="todo TODO">TODO</span> Functor Constraints</h2>
<div class="outline-text-2" id="text-org798ee8f">
<p>
Just like we can add constraints to <b>OCaml</b> functor applications, we
should also be allowed to add additional <b>Gospel</b> constraints. For
example:
</p>
<pre class="example" id="org1d41388">
module Make 
  (H : HashedType)
  (S : SENTINELS with type t = H.t)
  : SET with type element = H.t
  (*@ with predicate equiv = H.equiv and
           function  tomb = S.tomb   and
           function  void = S.void 
           *)
</pre>
</div>
</div>
<div id="outline-container-orgf87e6e5" class="outline-2">
<h2 id="orgf87e6e5">Updated syntax</h2>
<div class="outline-text-2" id="text-orgf87e6e5">
<p>
In Gospel there is no way to talk about ownership of values when an
exception is raised. To this end, we propose an updated syntax to
allow users to write multiple specifications for each possible raised
exception. 
</p>

<p>
Currently, Gospel specifications start with a header where we define
the names of the arguments and return values, which is then followed
up with pre and postconditions and other clauses. Our proposal is to
have an alternate syntax where the header appears after clauses that
describe the program state before the function is called (requires,
consumes, etc) and before clauses that describe the state after the
function returns. For example, the specification for a pop function of
a queue would be written as:
</p>
<pre class="example" id="org27669bf">

val pop : 'a queue -&gt; 'a
(*@ consumes q
    requires not (empty q)
    let x = pop q in
    produces q
    ensures x :: q = old q *)
</pre>
<p>
A peculiarity of this representation is that the function's
arguments are used before they are named in the function
call. This is similar to what Gospel does currently, where free
variables used in the function call are assumed to be universally
quantified, but a bit more non-standard.
</p>

<p>
In the special case where there are no exceptional clauses, the syntax
would be similar, but with no <code>in</code>.
</p>
<pre class="example" id="org47bbf02">
val pop : 'a queue -&gt; 'a
(*@ requires q &lt;&gt; empty
    let x = pop q in *)
</pre>
<p>
In the case of a function that may raise some exception, we would use
a match to describe its behavior in the normal case and the
exceptional case. For example, if we wish to describe the pop function
without using the precondition not (empty q) and instead with an
exceptional postcondition.
</p>
<pre class="example" id="orga78f22c">
val pop : 'a queue -&gt; 'a
(*@ consumes q
    match find q p with
    |exception Not_found -&gt;
       produces q
       ensures p = old p = Sequence.empty
    |r -&gt;
       produces q
       ensures x :: q = old q *)
</pre>
<p>
In this case, since we consume q and produce it in the exceptional and
non-exceptional specifications, we can use a modifies clause which is
sugar for a consumes and a produces in every postcondition.
</p>
<pre class="example" id="org004dc64">
val pop : 'a queue -&gt; 'a
(*@ modifies q
    match find q p with
    |exception Not_found -&gt;
       ensures p = old p = Sequence.empty
    |r -&gt;
       ensures x :: q = old q *)
</pre>
<p>
Naturally, integrating these changes would deprecate the current Gospel
syntax for specifications.
</p>
</div>
</div>

<div id="outline-container-orgdfce41a" class="outline-2">
<h2 id="orgdfce41a">Shared Resources</h2>
<div class="outline-text-2" id="text-orgdfce41a">
<p>
There is currently no way of capturing shared permissions in Gospel,
all values are exclusively owned by the functions that use them. To
solve this, we could take inspiration from the <a href="https://dl.acm.org/doi/10.1145/3622798">Leaf</a> library and add a
notion of resources guarding other resources.
</p>

<p>
In Leaf, the authors introduce the â¤” operator where G â¤” P means that
the resource G guards the resource P. In other words, we can exchange
exclusive ownership of resource G to obtain shared ownership of a
resource G. 
</p>
</div>

<div id="outline-container-org7b250c9" class="outline-3">
<h3 id="org7b250c9">Mutex example (monomorphic)</h3>
<div class="outline-text-3" id="text-org7b250c9">
<p>
Specification for a mutually exclusive lock that protects a single
reference.
</p>
<pre class="example" id="org2fa6484">
type mutex
(*@ model protectee : loc *)

val create : unit -&gt; mutex
(*@ consumes s @ int ref
    create [s : int ref] *)

val lock : mutex -&gt; unit
(*@ lock m
    produces m @ acquired (* not strictly nec*)
    produces m.protectee @ int ref *)

val unlock : mutex -&gt; unit
(*@ consumes m.protectee @ int ref
    consumes m @ acquired
    unlock m *)

val try_lock : mutex -&gt; bool
(*@ let b = lock m in
    produces b -&gt; m.protectee @ int ref *)
</pre>
</div>
</div>
<div id="outline-container-org1f1b025" class="outline-3">
<h3 id="org1f1b025">Mutex example</h3>
<div class="outline-text-3" id="text-org1f1b025">
<pre class="example" id="org45ada52">
type (*@ 's *) mutex

(*@ affine lens acquired (m : 's mutex) *)

val create : unit -&gt; (*@ 's *) mutex
(*@ consumes 's
    create () *)

val lock : (*@ 's *) mutex -&gt; unit
(*@ lock m
    produces 's *)

val unlock : (*@ 's *) mutex -&gt; unit
(*@ consumes 's
    unlock m *)

val try_lock : (*@ 's *) mutex -&gt; bool
(*@ try_lock m
    produces b -&gt; 's *)
</pre>
</div>
</div>
<div id="outline-container-org819a9bc" class="outline-3">
<h3 id="org819a9bc">Explicitly guarded mutex</h3>
<div class="outline-text-3" id="text-org819a9bc">
<pre class="example" id="orgff99882">
type 'a mutex

type 'a guard
(*@ ephemeral *)

val create : 'a -&gt; 'a mutex
(*@ consumes s 
    create s *)

val lock : 'a mutex -&gt; 'a guard
(*@ g = lock m *)

val unlock : 'a guard -&gt; unit
(*@ consumes g @ 'a guard
    unlock g *)

val peek : 'a guard -&gt; 'a
(*@ s = peek g
    produces g @ 'a guard &lt;-&gt; s @ 'a *)
</pre>
</div>
</div>
<div id="outline-container-org92d5a72" class="outline-3">
<h3 id="org92d5a72">Explicitly guarded mutex v2</h3>
<div class="outline-text-3" id="text-org92d5a72">
<pre class="example" id="orge799219">
type 'a mutex

type 'a guard

val create : 'a -&gt; 'a mutex
(*@ consumes s 
    create s *)

val lock : 'a mutex -&gt; 'a guard
(*@ g = lock m *)

val unlock : 'a guard -&gt; unit
(*@ consumes l @ 'a guard
    unlock l *)

val peek : 'a guard -&gt; 'a
(*@ s = peek g
    produces g @ 'a guard == s @ 'a *)

val try_lock : (*@ 's *) mutex -&gt; bool
(*@ try_lock m
    produces b -&gt; 's *)
</pre>
</div>
</div>
