content/notes.org
** Shared Lock
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
type (*@ 'a *) rw_lock
(*@ ephemeral *)

(*@ type 'a exc
    ephemeral
    model m : loc
    model state : 'a *)

(*@ type 'a sh
    guards : 'a
    model m : loc
    model state : 'a *)

val rwlock_new : unit -> (*@ 'a *) rw_lock
(*@ consumes s
    create [s : 'a] *)

val rwlock_free : (*@ 'a *) rw_lock -> unit
(*@ consumes m
    rwlock_free m *)

val lock_exc : (*@ 'a *) rw_lock -> unit
(*@ guarded  m
    let [e : exc] = lock m in
    produces e @ 'a exc
    ensures e.m = &m *)

val unlock_exc : (*@ 'a *) rw_lock -> unit
(*@ guarded m
    requires e.m = &m
    consumes e @ 'a exc
    unlock [e : exc] m *)

val lock_shared : (*@ 'a *) rw_lock -> unit
(*@ guarded m
    let [e : sh] = lock m in
    produces e @ 'a exc
    ensures e.m = &m *)

val unlock_shared : (*@ 'a *) rw_lock -> unit
(*@ guarded m
    requires e.m = &m
    consumes e @ 'a exc
    let () = unlock [e : exc] m *)
#+end_example

* Syntax for the Gospel Standard Library
When creating sequences, sets and bags, users are forces to use the
functions exposed in the standard library. For example, if one were to
create a set with every even number, they would have to write
#+ATTR_LATEX: :environment gospel
#+begin_example ocaml
  Set.init (fun x -> x mod 2 = 0)
#+end_example
This is not ideal, since it is very verbose as well as starkly
different from what one would expect from a mathematical
definition. In this section, I will describe possible changes to the
Gospel syntax to simplify writing specifications using the objects
defined in the standard library.

** The empty element
- Sequences : ~[]~
- Sets : ~{}~

** Initialization

- Sequences : ~[ x; y; z ]~ creates a sequence containing elements ~x~, ~y~,
  ~z~. These can be identifiers or formulas, but they naturally need to
  have the same type. A consequence of this is that the syntax for
  sequences would be the same for lists.

- Sets : ~{ x | fmla }~ creates a set with every element ~x~ that
  satisfies ~fmla~, which must be a valid proposition. An alternate way
  to create a set would be ~{ x; y; z }~ which creates a set with the
  values ~x~, ~y~, ~z~. These can be identifiers or formulas, but they
  naturally need to have the same type.

** Set operations

* Miscellaneous changes

Section for minor changes I made in Gospel that aren't relevant for
other sections.

** ~old~ in Gospel function specifications
In {{{Gospel}}} we can use the ~old~ constructor in the specification of
logical functions specifications. In my opinion, this should not be
allowed since there is no practical reason to talk about the "old"
version of a variable that is never modified.

* Gospel documentation
Fib numbers as first spec and machine integers
add requires for fibonacci to prevent overflow

Rewrite the first spec for clarity

fibonacci with big int

* Internal Changes to Gospel
** DONE Normalise AST constructors for function applications
- State "DONE"       from "TODO"       [2025-02-14 Fri 13:13]
Currently Gospel has four constructors for function applications:

- ~Tidapp~ for application of an identifier to a list of arguments.
- ~Tapply~ for arbitrary function applications
- ~Tinfix~ for infix operations that can be chained together (e.g.
~3 < 4 < 5~)
- ~Tbinop~ for binary operations.

From my review of the code, I believe in the untyped AST we only need
two constructors, one for arbitrary function applications and another
for infix operations. The later isn't strictly necessary, however,
during parsing the only way of desugaring infix operators into a
~Tapply~ would be with either completely changing the parsing of terms
in a way that is not obvious to me or during parsing modifying the AST
so that chained infix operators get turned into a chain of ~/\~ which
would be a bit painful. Right now, this transformation is done during
typechecking which also feels wrong. I believe that the best way of
going about doing this is to replace the ~Tinfix~ node with something
that better describes a chain of infix operators.

I also found a funny bug. The following program should be accepted,
but isn't:
#+ATTR_LATEX: :environment ocamlenv
#+begin_example ocaml
(*@ function (<) (n : 'a) (m : 'a) : bool *)

(*@ function works : bool =
      (1 < 2) < true *)

(*@ function wrong : bool =
      true < (1 < 2) *)
#+end_src
** TODO Gospel Type checker with [[https://cambium.inria.fr/~fpottier/inferno/doc/inferno/index.html][Inferno]]

After doing some experiments with Inferno, I believe that is it a
better alternative to current Gospel typechecking, given the following
pros:

- Since Inferno is very high level and declarative, it becomes very
  easy to read, maintain and extend the type checker, as opposed to
  current Gospel which has to deal with all of the low level details
  of type checking and inference.

- It is less error prone since we are offloading a lot of the weight
  into Inferno, meaning we only have to ensure that all of our
  constraints are correct.

*** Things left to do
- [ ] Type declarations
  - [ ] Abstract type definitions
  - [ ] ADTs
  - [ ] Record types
  - [ ] Type aliases
- [ ] Logical Function declarations
  - [ ] Recursive definitions
- [ ] Modules
  - [ ] Module Alias
  - [ ] Functors
  - [ ] Module Constraints
    - [ ] ~With type~
    - [ ] ~With module~
- [ ] Module types
  - [ ] List of Signature
  - [ ] Functors
  - [ ] Module type Constraint
    - [ ] ~With type~
    - [ ] Type substitution
  - [ ] Module alias
- [ ] Value descriptions
- [ ] Module opens
- [ ] Exceptions
- [-] Terms
  - [ ] Told
  - [X] Pattern matching
  - [ ] Records
  - [ ] Constructors

*** Issues
- When we introduce a quantified variable, it may be annotated with a type such
  as: ~forall x : 'a~. Currently, our typechecker does not work if ~'a~ has already
  been bound somewhere else. In order to fix this, we will have to keep track of
  all type variables in scope while building the inferno constraint.
