notes.html
<div id="outline-container-org867f5b0" class="outline-3">
<h3 id="org867f5b0">Shared Lock</h3>
<div class="outline-text-3" id="text-org867f5b0">
<pre class="example" id="orgeea6f71">
type (*@ 'a *) rw_lock
(*@ ephemeral *)

(*@ type 'a exc
    ephemeral
    model m : loc
    model state : 'a *)

(*@ type 'a sh
    guards : 'a
    model m : loc
    model state : 'a *)

val rwlock_new : unit -&gt; (*@ 'a *) rw_lock
(*@ consumes s
    create [s : 'a] *)

val rwlock_free : (*@ 'a *) rw_lock -&gt; unit
(*@ consumes m
    rwlock_free m *)

val lock_exc : (*@ 'a *) rw_lock -&gt; unit
(*@ guarded  m
    let [e : exc] = lock m in
    produces e @ 'a exc
    ensures e.m = &amp;m *)

val unlock_exc : (*@ 'a *) rw_lock -&gt; unit
(*@ guarded m
    requires e.m = &amp;m
    consumes e @ 'a exc
    unlock [e : exc] m *)

val lock_shared : (*@ 'a *) rw_lock -&gt; unit
(*@ guarded m
    let [e : sh] = lock m in
    produces e @ 'a exc
    ensures e.m = &amp;m *)

val unlock_shared : (*@ 'a *) rw_lock -&gt; unit
(*@ guarded m
    requires e.m = &amp;m
    consumes e @ 'a exc
    let () = unlock [e : exc] m *)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3b3355" class="outline-2">
<h2 id="orgc3b3355">Syntax for the Gospel Standard Library</h2>
<div class="outline-text-2" id="text-orgc3b3355">
<p>
When creating sequences, sets and bags, users are forces to use the
functions exposed in the standard library. For example, if one were to
create a set with every even number, they would have to write
</p>
<pre class="example" id="org90e62b8">
Set.init (fun x -&gt; x mod 2 = 0)
</pre>
<p>
This is not ideal, since it is very verbose as well as starkly
different from what one would expect from a mathematical
definition. In this section, I will describe possible changes to the
Gospel syntax to simplify writing specifications using the objects
defined in the standard library.
</p>
</div>

<div id="outline-container-org98ec0a7" class="outline-3">
<h3 id="org98ec0a7">The empty element</h3>
<div class="outline-text-3" id="text-org98ec0a7">
<ul class="org-ul">
<li>Sequences : <code>[]</code></li>
<li>Sets : <code>{}</code></li>
</ul>
</div>
</div>

<div id="outline-container-org31e64a4" class="outline-3">
<h3 id="org31e64a4">Initialization</h3>
<div class="outline-text-3" id="text-org31e64a4">
<ul class="org-ul">
<li>Sequences : <code>[ x; y; z ]</code> creates a sequence containing elements <code>x</code>, <code>y</code>,
<code>z</code>. These can be identifiers or formulas, but they naturally need to
have the same type. A consequence of this is that the syntax for
sequences would be the same for lists.</li>

<li>Sets : <code>{ x | fmla }</code> creates a set with every element <code>x</code> that
satisfies <code>fmla</code>, which must be a valid proposition. An alternate way
to create a set would be <code>{ x; y; z }</code> which creates a set with the
values <code>x</code>, <code>y</code>, <code>z</code>. These can be identifiers or formulas, but they
naturally need to have the same type.</li>
</ul>
</div>
</div>

<div id="outline-container-org89d2422" class="outline-3">
<h3 id="org89d2422">Set operations</h3>
</div>
</div>

<div id="outline-container-orgf7d83bd" class="outline-2">
<h2 id="orgf7d83bd">Miscellaneous changes</h2>
<div class="outline-text-2" id="text-orgf7d83bd">
<p>
Section for minor changes I made in Gospel that aren't relevant for
other sections.
</p>
</div>

<div id="outline-container-org10918b6" class="outline-3">
<h3 id="org10918b6"><code>old</code> in Gospel function specifications</h3>
<div class="outline-text-3" id="text-org10918b6">
<p>
In <b>Gospel</b> we can use the <code>old</code> constructor in the specification of
logical functions specifications. In my opinion, this should not be
allowed since there is no practical reason to talk about the "old"
version of a variable that is never modified.
</p>
</div>
</div>
</div>

<div id="outline-container-org3f6c56b" class="outline-2">
<h2 id="org3f6c56b">Gospel documentation</h2>
<div class="outline-text-2" id="text-org3f6c56b">
<p>
Fib numbers as first spec and machine integers
add requires for fibonacci to prevent overflow
</p>

<p>
Rewrite the first spec for clarity
</p>

<p>
fibonacci with big int
</p>
</div>
</div>

<div id="outline-container-org79eaca6" class="outline-2">
<h2 id="org79eaca6">Internal Changes to Gospel</h2>
<div class="outline-text-2" id="text-org79eaca6">
</div>
<div id="outline-container-org09758ee" class="outline-3">
<h3 id="org09758ee"><span class="done DONE">DONE</span> Normalise AST constructors for function applications</h3>
<div class="outline-text-3" id="text-org09758ee">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2025-02-14 Fri 13:13]</span></span></li>
</ul>
<p>
Currently Gospel has four constructors for function applications:
</p>

<ul class="org-ul">
<li><code>Tidapp</code> for application of an identifier to a list of arguments.</li>
<li><code>Tapply</code> for arbitrary function applications</li>
<li><code>Tinfix</code> for infix operations that can be chained together (e.g.</li>
</ul>
<p>
<code>3 &lt; 4 &lt; 5</code>)
</p>
<ul class="org-ul">
<li><code>Tbinop</code> for binary operations.</li>
</ul>

<p>
From my review of the code, I believe in the untyped AST we only need
two constructors, one for arbitrary function applications and another
for infix operations. The later isn't strictly necessary, however,
during parsing the only way of desugaring infix operators into a
<code>Tapply</code> would be with either completely changing the parsing of terms
in a way that is not obvious to me or during parsing modifying the AST
so that chained infix operators get turned into a chain of <code>/\</code> which
would be a bit painful. Right now, this transformation is done during
typechecking which also feels wrong. I believe that the best way of
going about doing this is to replace the <code>Tinfix</code> node with something
that better describes a chain of infix operators.
</p>

<p>
I also found a funny bug. The following program should be accepted,
but isn't:
</p>
<p>
#+begin<sub>example</sub> ocaml
(*@ function (&lt;) (n : 'a) (m : 'a) : bool *)
</p>

<p>
(*@ function works : bool =
      (1 &lt; 2) &lt; true *)
</p>

<p>
(*@ function wrong : bool =
      true &lt; (1 &lt; 2) *)
#+end<sub>src</sub>
</p>
</div>
</div>
<div id="outline-container-org938be6d" class="outline-3">
<h3 id="org938be6d"><span class="todo TODO">TODO</span> Gospel Type checker with <a href="https://cambium.inria.fr/~fpottier/inferno/doc/inferno/index.html">Inferno</a></h3>
<div class="outline-text-3" id="text-org938be6d">
<p>
After doing some experiments with Inferno, I believe that is it a
better alternative to current Gospel typechecking, given the following
pros:
</p>

<ul class="org-ul">
<li>Since Inferno is very high level and declarative, it becomes very
easy to read, maintain and extend the type checker, as opposed to
current Gospel which has to deal with all of the low level details
of type checking and inference.</li>

<li>It is less error prone since we are offloading a lot of the weight
into Inferno, meaning we only have to ensure that all of our
constraints are correct.</li>
</ul>
</div>

<div id="outline-container-org77c823d" class="outline-4">
<h4 id="org77c823d">Things left to do</h4>
<div class="outline-text-4" id="text-org77c823d">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Type declarations
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Abstract type definitions</li>
<li class="off"><code>[&#xa0;]</code> ADTs</li>
<li class="off"><code>[&#xa0;]</code> Record types</li>
<li class="off"><code>[&#xa0;]</code> Type aliases</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Logical Function declarations
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Recursive definitions</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Modules
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Module Alias</li>
<li class="off"><code>[&#xa0;]</code> Functors</li>
<li class="off"><code>[&#xa0;]</code> Module Constraints
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <code>With type</code></li>
<li class="off"><code>[&#xa0;]</code> <code>With module</code></li>
</ul></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Module types
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> List of Signature</li>
<li class="off"><code>[&#xa0;]</code> Functors</li>
<li class="off"><code>[&#xa0;]</code> Module type Constraint
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <code>With type</code></li>
<li class="off"><code>[&#xa0;]</code> Type substitution</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Module alias</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Value descriptions</li>
<li class="off"><code>[&#xa0;]</code> Module opens</li>
<li class="off"><code>[&#xa0;]</code> Exceptions</li>
<li class="trans"><code>[-]</code> Terms
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Told</li>
<li class="on"><code>[X]</code> Pattern matching</li>
<li class="off"><code>[&#xa0;]</code> Records</li>
<li class="off"><code>[&#xa0;]</code> Constructors</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga8dc7be" class="outline-4">
<h4 id="orga8dc7be">Issues</h4>
<div class="outline-text-4" id="text-orga8dc7be">
<ul class="org-ul">
<li>When we introduce a quantified variable, it may be annotated with a type such
as: <code>forall x : 'a</code>. Currently, our typechecker does not work if <code>'a</code> has already
been bound somewhere else. In order to fix this, we will have to keep track of
all type variables in scope while building the inferno constraint.</li>
</ul>
</div>
</div>
</div>
