content/notes.org
** DONE Inferno Efficiency
- State "DONE"       from "ðŸ‘ï¸ðŸ‘„ðŸ‘ï¸"       [2025-02-14 Fri 13:13]
One possible downside is that I'm not sure with regards with
efficiency how Inferno behaves. More specifically, when does Inferno
populate the data structures it needs for type unification? Is it when
the constraint is built or when ~solve~ is called? If the later, there
are some real questions with regards to efficiency
