notes.html
<div id="outline-container-org4f6a2b9" class="outline-3">
<h3 id="org4f6a2b9"><span class="done DONE">DONE</span> Inferno Efficiency</h3>
<div class="outline-text-3" id="text-org4f6a2b9">
<ul class="org-ul">
<li>State "DONE"       from "ðŸ‘ï¸ðŸ‘„ðŸ‘ï¸"       <span class="timestamp-wrapper"><span class="timestamp">[2025-02-14 Fri 13:13]</span></span></li>
</ul>
<p>
One possible downside is that I'm not sure with regards with
efficiency how Inferno behaves. More specifically, when does Inferno
populate the data structures it needs for type unification? Is it when
the constraint is built or when <code>solve</code> is called? If the later, there
are some real questions with regards to efficiency
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
